DEFINE DATA
PARAMETER
1 P-SERVICE (A8)
1 P-SELCRUISEID (N8)
PARAMETER USING NCCOMM-P
PARAMETER USING NCCUGE-P
PARAMETER USING NCCONW-P
PARAMETER USING NCCRUL-P
END-DEFINE
/* Isomorphic-authored headless ABI driver. One run selects one service.
DECIDE ON FIRST VALUE OF P-SERVICE
  VALUE 'CUGET'
    CALLNAT 'CUGET-N' P-COM P-RESPONSE P-SELECTION P-CUSTOMER-DATA
  VALUE 'CUNEW'
    CALLNAT 'CUNEW-N' P-COM P-RESPONSE P-SELECTION P-CUSTOMER-DATA
  VALUE 'CUMOD'
    CALLNAT 'CUMOD-N' P-COM P-RESPONSE P-SELECTION P-CUSTOMER-DATA
  VALUE 'CONEW'
    CALLNAT 'CONEW-N' P-COM P-RESPONSE P-CONTRACT-DATA P-NEW-CONTRACTID
  VALUE 'CRGET'
    /* NCCRUL-P spells its upstream group P-SELETION; no argument is omitted.
    CALLNAT 'CRGET-N' P-COM P-RESPONSE P-SELETION P-NUMBER-OF-RECORDS P-CRUISE-DATA P-SELCRUISEID
  VALUE 'CRLIST'
    CALLNAT 'CRLIST-N' P-COM P-RESPONSE P-SELETION P-NUMBER-OF-RECORDS P-CRUISE-DATA
  NONE
    MOVE '9800' TO P-RESPONSE.P-RSPCODE
    MOVE 'Unknown service' TO P-RESPONSE.P-RSPTXT
END-DECIDE
END
